{"id":8179,"date":"2020-11-03T09:30:28","date_gmt":"2020-11-03T09:30:28","guid":{"rendered":"https:\/\/avsgroup.in\/?p=8179"},"modified":"2021-02-02T17:39:04","modified_gmt":"2021-02-02T17:39:04","slug":"avs-presence-in-comesa-ecowas","status":"publish","type":"post","link":"https:\/\/avsgroup.in\/2020\/11\/03\/avs-presence-in-comesa-ecowas\/","title":{"rendered":"AVS presence in COMESA &#038; ECOWAS"},"content":{"rendered":"\n<p>Economic Community of West African States (ECOWAS) is a union of politics and economy of the 15 West African countries. This body promotes economic integration and serves as a peace making entity when any of the member countries face political instability.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"https:\/\/avsgroup.in\/wp-content\/uploads\/2020\/07\/avs-with-Ecowas-and-Comesa-small-image-1024x491.jpg\" alt=\"\" class=\"wp-image-1380\"\/><\/figure>\n\n\n\n<p>Whereas, Common Market for Eastern and Southern Africa (COMESA), is a vast free trade area with 21 member states from Tunisia to Eswatini. Both of these entities are seen as a major market for trade on a global level.<\/p>\n\n\n\n<p>AVS International, an MNC based out of India is marking its presence in the countries and states involved in COMESA and ECOWAS. It is doing so by supplying different types of commodities and products to these countries.<\/p>\n\n\n\n<p>The company has tie-ups with the government of African countries which has helped it to enhance its market. Moreover, AVS has set a record of supplying 104 fire tenders to Ghana making it Asia’s largest exporter in the segment that year.<\/p>\n\n\n\n<h1 id=\"h-products-exported-by-avs-to-comesa-ecowas\">Products exported by AVS to COMESA &amp; ECOWAS<\/h1>\n\n\n\n<p>AVS International is continuously expanding its reach by investing in ECOWAS and COMESA members. The company has a wide range of products from specialized footwear to heavy-duty vehicles. Let’s take a look at the different varieties of products that AVS is offering to different countries and is making a huge impact.<\/p>\n\n\n\n<h1 id=\"h-specialized-footwear\"><strong>Specialized Footwear<\/strong><\/h1>\n\n\n\n<h2 id=\"h-1-army-shoes\">1.&nbsp; Army Shoes<\/h2>\n\n\n\n<p>The military men need to be safeguarded as they are always on duty to protect the nation. For this purpose, army shoes, also known as “combat boots” were manufactured. The combat boots are now also becoming a trendy choice amongst civilians.<\/p>\n\n\n\n<h2 id=\"h-2-safety-shoes\">2.&nbsp; Safety shoes<\/h2>\n\n\n\n<p>To avoid any mishaps at the workplace and protect the feet of the worker in factories and industries, safety shoes came into existence. These shoes are also known as steel-toe boots and steel-capped boots.<\/p>\n\n\n\n<h3 id=\"h-\">&nbsp;<\/h3>\n\n\n\n<h3 id=\"h-army-and-safety-shoes-famous-models-by-avs-international\">Army and Safety shoes famous models by AVS International-<\/h3>\n\n\n\n<ul><li><strong>Leather shoes for ladies- <\/strong>Used for protecting the feet as well as for being a fashion trend, these are specially designed for ladies. Made of leather, these shoes are durable and comfortable that allows the feet to breathe.<\/li><li><strong>DMS Boot, (canvas)- <\/strong>Perfect for use in different environmental conditions, these boots contain a directly moulded sole with canvas material that is water-repellent.<\/li><li><strong>Jodhpuri, (rubber sole) &#8211; <\/strong>Suitable for workers in manufacturing, mining, petrochemical, and hot surface industries, this footwear has a rubber sole and is heat-resistant.<\/li><li><strong>Fuel boot, (rubber sole) &#8211; <\/strong>Specially designed for safety purposes, this footwear has a sole made of rubber and is water-resistant.<\/li><li><strong>Long boot &#8211;<\/strong> This footwear is suitable for both men and women who need to protect their feet while working in extreme weather conditions.<\/li><li><strong>Eyelet boot, (DMS) &#8211; <\/strong>These shoes provide space for laces and are made of directly moulded sole mainly used by miners, army, police, and defence forces.<\/li><\/ul>\n\n\n\n<h2 id=\"h-3-formal-shoes\">3.&nbsp; <strong>&nbsp;<\/strong>Formal Shoes<\/h2>\n\n\n\n<p>These shoes are specially designed to be worn at events like black-tie events, office meetings, and cocktail parties that give a professional look.<\/p>\n\n\n\n<h3 id=\"h-top-formal-shoe-models-at-avs-international\">Top formal shoe models at AVS International-<strong><\/strong><\/h3>\n\n\n\n<ul><li><strong>Oxford Shoes (leather) &#8211; <\/strong>Also known as close front shoe, these shoes have eyelets facing stitched under the vamp with the bottom of the lacing section sewn closed.<\/li><\/ul>\n\n\n\n<ul><li><strong>Derby shoes &#8211;<\/strong> Also known as Gibson shoes, these have eyelets facing sewn on top of the vamp. The lacing section is kept open and not sewn close to the bottom.<\/li><\/ul>\n\n\n\n<h1 id=\"h-heavy-equipment-fire-tenders\"><strong>Heavy Equipment &amp; Fire Tenders<\/strong><\/h1>\n\n\n\n<p>A heavy-duty vehicleis majorly used for long haul transportation and weighs around 26,001 pounds. Some examples include- road roller, excavator, mobile cranes, and dump truck. <\/p>\n\n\n\n<p>Also referred to as a heavy-duty machine or heavy equipment, <strong>heavy-duty vehicles <\/strong>are designed to perform construction tasks mainly earthwork operations. It comprises 5 equipment systems: implementation, traction, structure, power train, information, and control.<\/p>\n\n\n\n<h2 id=\"h-rescue\">Rescue<\/h2>\n\n\n\n<h3 id=\"h-fire-tenders\">Fire tenders<\/h3>\n\n\n\n<p>Also known as fire engines, fire trucks, or firefighting apparatus, these vehicles are specially designed to deal with the fire of different geographic locations. They come in small to large sizes as per the requirements. A fire engine usually transports the firefighters and firefighting equipment at the place of incident.&nbsp;<\/p>\n\n\n\n<h4 id=\"h-types-of-fire-tenders-supplied-by-avs-international\"><strong>Types of fire tenders supplied by AVS International:<\/strong><\/h4>\n\n\n\n<ul><li><strong>Airport Crash Tender-<\/strong> It is specially designed to deal with fire incidents at aerodromes, airports, military airbase, and aircraft rescue.<\/li><li><strong>Water Tenders-<\/strong> These fire fighting vehicles can carry a large amount of water to the place of the incident.<\/li><li><strong>Wild land Fire Engine-<\/strong> These are specially designed to transport fire fighters, equipment, and water to fight with wildfire.<\/li><li><strong>Tiller truck-<\/strong> This truck is divided into two sections namely a trailer and a tractor, which are permanently connected. It requires two drivers to run this truck as both sections have independent steering wheels.<\/li><li><strong>Turntable Ladder-<\/strong> As the name suggests, these fire engines have a ladder mounted on a pivot, which helps fire fighters to reach higher locations.<\/li><li><strong>Platform Truck-<\/strong> This truck usually carries a platform that can be elevated to a certain height, providing a safe base for fire fighters to attack the fire.&nbsp;<\/li><\/ul>\n\n\n\n<h2 id=\"h-construction\">Construction<\/h2>\n\n\n\n<h3 id=\"h-1-loader\">1.&nbsp;&nbsp; Loader<\/h3>\n\n\n\n<p>A heavy-duty truck that moves or loads the construction materials from one place and transfers onto a dump truck or another machinery like a conveyor belt. <\/p>\n\n\n\n<p>The materials can be dirt, snow, logs, gravel, asphalt, sand, rock, or raw minerals. It has a bucket at the front side connected on the ends of two booms, which serves as a scoop to load the material to be transferred.<\/p>\n\n\n\n<h3 id=\"h-2-crane\">2.&nbsp;&nbsp; Crane<\/h3>\n\n\n\n<p>Crane is also a heavy-duty truck<strong>,<\/strong> used in transportation for loading and unloading of materials, in construction for moving of materials from one place to another and in manufacturing for assembling of heavy machines. It consists of sheaves and wire ropes used for lifting and moving of materials.<\/p>\n\n\n\n<h3 id=\"h-3-bulldozer\">3.&nbsp;&nbsp; Bulldozer<\/h3>\n\n\n\n<p>It is a type of tractor used for moving or pushing materials like sand or soil in a large quantity. A bulldozer consists of two tools namely a ripper and a blade. <\/p>\n\n\n\n<p>Ripper is attached to the backside of the bulldozer and is a claw-like device used to break rocky surfaces into small riddles. Whereas, a blade is a heavy metal plate used to push materials from one place to another.<\/p>\n\n\n\n<h2 id=\"h-defence\">Defence<\/h2>\n\n\n\n<h3 id=\"h-1-crash-fire-tender\">1.&nbsp;&nbsp; Crash Fire Tender<\/h3>\n\n\n\n<p>It is a type of <strong>heavy-duty truck<\/strong> specially designed for aircraft rescue and firefighting at military airbases. They consist of high capacity pumps and water cannons, which helps to deal with fire over long distances.<\/p>\n\n\n\n<h3 id=\"h-2-heavy-recovery-vehicle\">2.&nbsp;&nbsp; Heavy Recovery Vehicle<\/h3>\n\n\n\n<p>These are used to recover stalled, buried, or overturned vehicles of the defence forces. Heavy recovery vehicles are capable of working in different terrains including desert, rocky and marshy grounds as well as hilly areas.<\/p>\n\n\n\n<h3 id=\"h-3-tetra-trucks\">3.&nbsp;&nbsp; Tetra Trucks<\/h3>\n\n\n\n<p>One of the specialties of AVS International, it is a terrain vehicle with high mobility used for GS roles in the Indian Army. Additionally, it transports army personnel and can carry payloads of about 10,500 kgs. It has a tire inflation system that enables the inflation\/deflation of tires depending on the condition of the terrain.<\/p>\n\n\n\n<h3 id=\"h-4-aircraft-re-fuellers\">4.&nbsp;&nbsp; Aircraft Re-fuellers<\/h3>\n\n\n\n<p>These are used for transporting aviation fuel into the military aircraft. Also, they offer over wing and underwing refuelling along with operational control on the driver’s side. They are designed for both right-hand and left-hand traffic and are assembled on a three-axle truck chassis.<\/p>\n\n\n\n<h2 id=\"h-mining\">Mining<\/h2>\n\n\n\n<h3 id=\"h-1-haul-trucks\">1.&nbsp;&nbsp; Haul Trucks<\/h3>\n\n\n\n<p>These are specially designed rigid dump trucks for high production mining. It takes or moves dumps of materials like sand or gravel to clear the path.&nbsp; It is also used for taking construction equipment from job site to job site. Haul truck capacity ranges from 40 short tons to 496 short tons.<\/p>\n\n\n\n<h3 id=\"h-2-excavator\">2.&nbsp;&nbsp; &nbsp;Excavator<\/h3>\n\n\n\n<p>These are also known as diggers and are used for digging trenches, construction, mining, forestry work, and demolition. It consists of a boom, dipper, bucket, and a cab that rotates on a platform. An excavator makes the use of hydraulic motors, cylinders, and fluid for performing multiple operations.<\/p>\n\n\n\n<h1 id=\"h-avs-in-ecowas-comesa\">AVS in ECOWAS &amp; COMESA<\/h1>\n\n\n\n<p>ECOWAS and COMESA provide a good scope as a large trading block for industries to invest in the exporting business. With these entities, the West African region is trying to improve its economy, grow the private sector, and establish a secure investment environment. <\/p>\n\n\n\n<p>And in order to do this, it gives global organizations a chance to expand their businesses by providing different types of products.<\/p>\n\n\n\n<p>AVS International is embarking its presence in ECOWAS and COMESA. With its versatile range of products that are high in quality is helping the organization to stand out from others.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Economic Community of West African States (ECOWAS) is a union of politics and economy of the 15 West African countries. This body promotes economic integration and serves as a peace making entity when any of the member countries face political instability. Whereas, Common Market for Eastern and Southern Africa (COMESA), is a vast free trade<br \/><a href=\"https:\/\/avsgroup.in\/2020\/11\/03\/avs-presence-in-comesa-ecowas\/\" class=\"more\">Read more<\/a><\/p>\n","protected":false},"author":3,"featured_media":8192,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8179"}],"collection":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/comments?post=8179"}],"version-history":[{"count":2,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8179\/revisions"}],"predecessor-version":[{"id":8910,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8179\/revisions\/8910"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media\/8192"}],"wp:attachment":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media?parent=8179"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/categories?post=8179"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/tags?post=8179"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}