{"id":8180,"date":"2020-11-03T09:34:35","date_gmt":"2020-11-03T09:34:35","guid":{"rendered":"https:\/\/avsgroup.in\/?p=8180"},"modified":"2021-02-02T17:39:04","modified_gmt":"2021-02-02T17:39:04","slug":"avs-now-associated-with-beml","status":"publish","type":"post","link":"https:\/\/avsgroup.in\/2020\/11\/03\/avs-now-associated-with-beml\/","title":{"rendered":"AVS now associated with BEML"},"content":{"rendered":"\n<p>BEML, a leading manufacturer of military equipment in India serves the Indian army and other defence forces. It manufactures variants of Tatra vehicles used for construction, mining, defence, and transportation. <\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"https:\/\/avsgroup.in\/wp-content\/uploads\/2020\/07\/avs-associate-BEML-small-image-1024x491.jpg\" alt=\"\" class=\"wp-image-1382\"\/><\/figure>\n\n\n\n<p>As an Indian public sector undertaking, it has a wide range of heavy-duty vehicles and equipment designed for special purposes. Many companies are associated with BEML India that is direct suppliers of motor vehicles.<\/p>\n\n\n\n<p>Being one of the important organizations serving the defence services, BEML supplies ground support vehicles aiding to the Integrated Guided Missile Development Project. <\/p>\n\n\n\n<p>Additionally, BEML has ventured into the aerospace industry seeing the growth opportunities in the local and global markets. With products like Aircraft Towing Tractor (ATT), Aircraft Weapon Loading Trolley, Multi-Purpose Weapon Loader (MPWL Bheema), and Crash Fire Tender (CFT), the organization has launched an aerospace manufacturing division.<\/p>\n\n\n\n<h1 id=\"h-avs-and-beml-association\">AVS and BEML association<\/h1>\n\n\n\n<p>AVS International Pvt. Ltd. is a renowned name in the industry for manufacturing and supplying heavy-duty vehicles. It manufactures a wide range of earthmoving equipment for mining, construction, transportation, irrigation, and power.<\/p>\n\n\n\n<p>The company is now directly associated with the Indian public sector undertaking BEML. AVS International is a trusted supplier of <strong>heavy-duty machines<\/strong> and vehicles to BEML and this association has benefitted both the companies in increasing their brand value.<\/p>\n\n\n\n<p>This has also helped AVS International to gain potential clients within the country in different sectors like defence, rescue, railway, and aerospace. The company has already ventured into different fields like the manufacturing of safety shoes and equipment, specialized footwear, heavy-duty vehicles, digital marketing, and security services.<\/p>\n\n\n\n<p>&nbsp;Also, it has created its space in the international market and has won several accolades for the same. Amongst which winning the EEPC award 5 times in the motor vehicles category as an exporter of the year has increased the company’s market value.<\/p>\n\n\n\n<p>A heavy-duty truck that has made AVS stand out from other manufacturers in the country is Tatra truck, used by the defence services. AVS International is the only manufacturer of this truck in India.<\/p>\n\n\n\n<h2 id=\"h-avs-tatra-truck-speciality\">AVS’ Tatra Truck speciality-<\/h2>\n\n\n\n<p>It is a terrain vehicle with high mobility used for GS roles in the Indian Army. Additionally, it transports army personnel and can carry payloads of about 10,500 kgs. It has a tire inflation system that enables the inflation\/deflation of tires depending on the condition of the terrain.<\/p>\n\n\n\n<h1 id=\"h-avs-and-beml-clientele\">AVS and BEML clientele<\/h1>\n\n\n\n<ul><li>Ministry of Defence (Indian Army, Navy, Air Force)<\/li><li>Indian Railways<\/li><li>Vehicle Research &amp; Development Establishment (VRDE), Ahmednagar<\/li><li>Combat Vehicle Research &amp; Development Establishment (CVRDE), Chennai<\/li><li>Electronics and Radar Development Establishment (LRDE), Bangalore<\/li><li>Research &amp; Development Establishment (Engineers) (R&amp;DE(E)), Pune<\/li><li>Heavy Vehicles Factory, Avadi<\/li><li>Gun Carriage Factory, Jabalpur<\/li><li>Ordnance Factory, Medak<\/li><li>Aeronautical Development Agency, Bangalore<\/li><\/ul>\n\n\n\n<h1 id=\"h-products-by-avs-and-beml-association\">Products by AVS and BEML association<\/h1>\n\n\n\n<p>The tie-up between AVS and BEML has resulted in a wide range of products including every type of equipment required in the process of construction, mining, defence, agriculture, and aerospace.<\/p>\n\n\n\n<p>Construction<\/p>\n\n\n\n<h3 id=\"h-1-loader\">1.&nbsp;&nbsp; Loader<\/h3>\n\n\n\n<p>A heavy-duty truck that moves or loads the construction materials from one place and transfers onto a dump truck or another machinery like a conveyor belt. <\/p>\n\n\n\n<p>The materials can be dirt, snow, logs, gravel, asphalt, sand, rock, or raw minerals. It has a bucket at the front side connected on the ends of two booms, which serves as a scoop to load the material to be transferred.<\/p>\n\n\n\n<h3 id=\"h-2-crane\">2.&nbsp;&nbsp; Crane<\/h3>\n\n\n\n<p>Crane is also a heavy-duty truck<strong>,<\/strong> used in transportation for loading and unloading of materials, in construction for moving of materials from one place to another and in manufacturing for assembling of heavy machines. It consists of sheaves and wire ropes used for lifting and moving of materials.<\/p>\n\n\n\n<h3 id=\"h-3-bulldozer\">3.&nbsp;&nbsp; Bulldozer<\/h3>\n\n\n\n<p>It is a type of tractor used for moving or pushing materials like sand or soil in a large quantity. A bulldozer consists of two tools namely a ripper and a blade. Ripper is attached to the backside of the bulldozer and is a claw-like device used to break rocky surfaces into small riddles. Whereas, a blade is a heavy metal plate used to push materials from one place to another.<\/p>\n\n\n\n<h3 id=\"h-4-dump-truck\">4.&nbsp;&nbsp; Dump Truck<\/h3>\n\n\n\n<p>A dump truck is used for taking dumps of sand or demolition wastes for construction purposes. It is also known as a tipper truck or tip-trailer that contains hydraulic rams to uplift the front portion of the open bed box of the truck.<\/p>\n\n\n\n<h2 id=\"h-mining\">Mining<\/h2>\n\n\n\n<h3 id=\"h-1-haul-trucks\">1.&nbsp;&nbsp; Haul Trucks<\/h3>\n\n\n\n<p>These are specially designed rigid dump trucks for high production mining. It takes or moves dumps of materials like sand or gravel to clear the path.&nbsp; It is also used for taking construction equipment from job site to job site. Haul truck capacity ranges from 40 short tons to 496 short tons.<\/p>\n\n\n\n<h3 id=\"h-2-excavator\">2.&nbsp;&nbsp; &nbsp;Excavator<\/h3>\n\n\n\n<p>These are also known as diggers and are used for digging trenches, construction, mining, forestry work, and demolition. It consists of a boom, dipper, bucket, and a cab that rotates on a platform. An excavator makes the use of hydraulic motors, cylinders, and fluid for performing multiple operations.<\/p>\n\n\n\n<h2 id=\"h-defence-and-rescue\">Defence and rescue<\/h2>\n\n\n\n<h3 id=\"h-1-crash-fire-tender\">1.&nbsp;&nbsp; Crash Fire Tender<\/h3>\n\n\n\n<p>It is a type of <strong>heavy-duty truck<\/strong> specially designed for aircraft rescue and firefighting at military airbases. They consist of high capacity pumps and water cannons, which helps to deal with fire over long distances.<\/p>\n\n\n\n<h3 id=\"h-2-heavy-recovery-vehicle\">2.&nbsp;&nbsp; Heavy Recovery Vehicle<\/h3>\n\n\n\n<p>These are used to recover stalled, buried, or overturned vehicles of the defence forces. Heavy recovery vehicles are capable of working in different terrains including desert, rocky and marshy grounds as well as hilly areas.<\/p>\n\n\n\n<h3 id=\"h-3-tatra-trucks\">3.&nbsp;&nbsp; Tatra Trucks<\/h3>\n\n\n\n<p>One of the specialties of AVS International, it is a terrain vehicle with high mobility used for GS roles in the Indian Army. Additionally, it transports army personnel and can carry payloads of about 10,500 kgs. It has a tire inflation system that enables the inflation\/deflation of tires depending on the condition of the terrain.<\/p>\n\n\n\n<h3 id=\"h-4-aircraft-refuellers\">4.&nbsp;&nbsp; Aircraft Refuellers<\/h3>\n\n\n\n<p>These are used for transporting aviation fuel into the military aircraft. Also, they offer over wing and under wing refueling along with operational control on the driver’s side. They are designed for both right-hand and left-hand traffic and are assembled on a three-axle truck chassis.<\/p>\n\n\n\n<h1 id=\"h-avs-international-an-emerging-market-player-in-the-global-heavy-vehicle-industry\">AVS International an emerging market player in the global heavy vehicle industry<\/h1>\n\n\n\n<p>With the rapid increase in industrialization and businesses shifting to e-commerce and online platforms, the heavy vehicles industry is all set to grow in the coming years. <\/p>\n\n\n\n<p>It is also estimated that this industry will register a CAGR of 4.5% during 2020-2025, which is good news for the exporters. Despite tough competition in the market, companies like AVS are emerging out as major market players.<\/p>\n\n\n\n<p>AVS International has also set a record of supplying 104 fire tenders to Ghana and has tie-ups with the African government. <\/p>\n\n\n\n<p>Besides this, the company is offering a versatile range of heavy equipment in association with BEML that also includes Compactors, Motor Graders, Pipe Layers, Tyre Handlers, Water Sprinklers, and Backhoe Loaders.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>BEML, a leading manufacturer of military equipment in India serves the Indian army and other defence forces. It manufactures variants of Tatra vehicles used for construction, mining, defence, and transportation. As an Indian public sector undertaking, it has a wide range of heavy-duty vehicles and equipment designed for special purposes. Many companies are associated with<br \/><a href=\"https:\/\/avsgroup.in\/2020\/11\/03\/avs-now-associated-with-beml\/\" class=\"more\">Read more<\/a><\/p>\n","protected":false},"author":3,"featured_media":8191,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8180"}],"collection":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/comments?post=8180"}],"version-history":[{"count":2,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8180\/revisions"}],"predecessor-version":[{"id":8909,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8180\/revisions\/8909"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media\/8191"}],"wp:attachment":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media?parent=8180"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/categories?post=8180"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/tags?post=8180"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}