{"id":8196,"date":"2020-11-03T09:43:29","date_gmt":"2020-11-03T09:43:29","guid":{"rendered":"https:\/\/avsgroup.in\/?p=8196"},"modified":"2021-02-02T17:39:04","modified_gmt":"2021-02-02T17:39:04","slug":"avs-takes-ghana-by-storm-delivers-104-industrial-fire-fighting-vehicle","status":"publish","type":"post","link":"https:\/\/avsgroup.in\/2020\/11\/03\/avs-takes-ghana-by-storm-delivers-104-industrial-fire-fighting-vehicle\/","title":{"rendered":"AVS takes Ghana by storm; delivers 104 Industrial fire fighting vehicle"},"content":{"rendered":"\n<p>With an increased demand for the safety of lands and the lives of citizens and the threat of fire in densely populated areas, different countries are purchasing more and more high standard <strong>Industrial fire fighting vehicle<\/strong>. <\/p>\n\n\n\n<figure class=\"is-layout-flex wp-block-gallery-1 wp-block-gallery columns-1 is-cropped\"><ul class=\"blocks-gallery-grid\"><li class=\"blocks-gallery-item\"><figure><img decoding=\"async\" src=\"https:\/\/avsgroup.in\/wp-content\/uploads\/2020\/07\/AVS-takes-Ghana-by-storm_-delivers-104-fire-fighting-vehicles-small-images-1024x491.jpg\" alt=\"\" data-id=\"1205\" class=\"wp-image-1205\"\/><\/figure><\/li><\/ul><\/figure>\n\n\n\n<p>Earlier human propelled water pumps were used as a fire fighter, but with technological advancement, a wide variety of these vehicles is available in the global market. This resulted in a new industry formation where many <strong><strong>Industrial fire fighting vehicle<\/strong> manufacturers<\/strong> are making a remarkable presence. <\/p>\n\n\n\n<p>Amongst this, AVS International Pvt. Ltd. has created a breathtaking record of delivering 104<strong> fire fighting vehicles<\/strong> to Ghana by winning their trust and becoming an international market player.<\/p>\n\n\n\n<p>The organization is a well-known name in India for manufacturing a vast range of products and providing different types of services. It is excelling and emerging out as a global pioneer for delivering safety products and <a href=\"https:\/\/avsgroup.in\/heavy-duty-vehicles-and-spare-parts\/\" target=\"_blank\" rel=\"noreferrer noopener\">heavy-duty vehicles<\/a>. <\/p>\n\n\n\n<p>Also, the organization’s fire fighting vehicles like fire tenders and aircraft refuellers are creating a huge impact on the international market. The range of these vehicles is not limited to only one model. Let’s have a look at the <a href=\"https:\/\/avsgroup.in\/fire-fighting-solutions\/\" target=\"_blank\" rel=\"noreferrer noopener\">different types of fire fighting vehicles<\/a>:<\/p>\n\n\n\n<p>Types of fire fighting vehicles-<\/p>\n\n\n\n<p>Also known as fire engines, fire trucks, or fire fighting apparatus, these vehicles are specially designed to deal with the fire of different geographic locations. Also, they come in small to large sizes as per the requirements. They usually transport the fire fighters and fire fighting equipment at the place of incident.<\/p>\n\n\n\n<h3 id=\"h-1-airport-crash-tender\">1.&nbsp; Airport Crash Tender<\/h3>\n\n\n\n<p>It is specially designed to deal with fire incidents at aerodromes, airports, military airbase, and aircraft rescue. One of the largest fire engines, these have special features that make it different. Some common features that <strong>fire fighting vehicle manufacturers<\/strong> add in their design are-<\/p>\n\n\n\n<ul><li>A foam tank with a large water capacity<\/li><li>An injection system that adds fire retardants and produces a stream of fire fighting foam<\/li><li>A high capacity pump<\/li><li>Water and foam monitors<\/li><\/ul>\n\n\n\n<h3 id=\"h-2-water-tenders\">2.&nbsp; Water Tenders<\/h3>\n\n\n\n<p>These <strong>fire fighting vehicles<\/strong> can carry a large amount of water to the place of the incident. It also contains a pump that allows the drafting of water into the tender from a water source like a stream or lake. Usually, water tenders are designed to carry about 10,000 litres of water.<\/p>\n\n\n\n<h3 id=\"h-3-wild-land-fire-engine\">3.&nbsp; Wild land Fire Engine<\/h3>\n\n\n\n<p>These are specially designed to transport fire fighters, equipment, and water to fight with wildfire. Unlike other fire engines, these are smaller in size. What makes them different from other vehicles is that they can pump water while driving and perform mobile attacks to save vegetation and forests.<\/p>\n\n\n\n<h3 id=\"h-4-conventional-fire-engine\">4.&nbsp; Conventional Fire Engine<\/h3>\n\n\n\n<p>These fire engines can carry a limited amount of water along with fire fighters and equipment. Although, the tools it can carry depends on different aspects like the size of the fire department and geographical locations. <\/p>\n\n\n\n<p>Some common tools that almost every fire engine includes are ladders, floodlights, hydraulic rescue tools, fire hose, fire extinguishers, and breathing apparatus. <strong>Industrial Fire fighting vehicle manufacturers<\/strong> also make use of pre-connects, also known as hose lines, which are connected to the engine’s onboard water supply and help fire fighters directly attack the fire.<\/p>\n\n\n\n<h3 id=\"h-5-aerial-apparatus\">5.&nbsp; Aerial Apparatus<\/h3>\n\n\n\n<p>This apparatus helps in creating an escape way for the rescuers and access way for the fire fighters. It takes the fire fighters to heightened locations and is majorly used by European and American fire fighting departments.<\/p>\n\n\n\n<h3 id=\"h-6-turntable-ladder\">6.&nbsp; Turntable Ladder<\/h3>\n\n\n\n<p>As the name suggests, these fire engines have a ladder mounted on a pivot, which helps fire fighters to reach higher locations. They are also known as “Quint Engines” because of their multifunctional nature. <\/p>\n\n\n\n<p>Thus, serving two purposes of an engine and a ladder truck with features like- pump, water tank, aerial device, ground ladders, and fire hose. The telescoping ladders have a monitor attached to it. Also, in some fire engines, the ladder has attached piping to supply water to higher locations.<\/p>\n\n\n\n<h3 id=\"h-7-tiller-truck\">7.&nbsp; Tiller truck<\/h3>\n\n\n\n<p>This truck is divided into two sections namely a trailer and a tractor, which are permanently connected. It requires two drives to run this truck as both the sections have independent steering wheels. <\/p>\n\n\n\n<p>Additionally, the length of this truck is over 50 feet, which is much larger than other fire engines. This creates a huge storage space for tools and equipment and avoids the requirement of separate trucks for different purposes. It is majorly used by small departments with a smaller staff.<\/p>\n\n\n\n<h3 id=\"h-8-platform-truck\">8.&nbsp; Platform Truck<\/h3>\n\n\n\n<p>This truck usually carries a platform that can be elevated to a certain height, providing a safe base for fire fighters to attack the fire. The platform is known as an aerial work platform or bucket which is connected at the end of the ladder. <\/p>\n\n\n\n<p>These platforms allow people to escape by the use of rappelling arms. Moreover, this fire engine overcomes the drawback of a ladder engine, which can be extended only in a straight line.<\/p>\n\n\n\n<p>Apart from the above categories, there are some special vehicles designed for different purposes related to fire fighting. This includes the Light and Air unit that carries supplemental lights and air bottles at the emergency location, Heavy rescue vehicle to transport technical equipment, Aerial fire fighting apparatus to combat wildlife fire, fireboats, and fire bikes, etc. <\/p>\n\n\n\n<p>Also, a fire truck uses different types of engine to work efficiently in different climatic conditions. Let’s take a look at them:<\/p>\n\n\n\n<h2 id=\"h-types-of-engines-used-in-a-industrial-fire-fighting-vehicle\">Types of engines used in a Industrial Fire Fighting Vehicle-<\/h2>\n\n\n\n<h3 id=\"h-1-liquid-cooled-engine\">1.&nbsp; Liquid Cooled Engine<\/h3>\n\n\n\n<p>Here water or coolant is used to cool the IC engine. Earlier only water was used for cooling but modernization replaced it with coolant. The coolant is a mixture of water and concentrated coolant in a 1:1 ratio. Also, it contains anti-freezing and anti-corrosion agents that protect the engine in different climatic conditions.<\/p>\n\n\n\n<h3 id=\"h-2-air-cooled-engine\">2.&nbsp; Air Cooled Engine<\/h3>\n\n\n\n<p>These engines make use of air circulation directly on the hot areas of the engine to make it cooler. Moreover, the surface area of motors increases as these engines are designed with fins on the outside, which improve the airflow around it.<\/p>\n\n\n\n<h3 id=\"h-3-oil-cooled-engine\">3.&nbsp; Oil Cooled Engine<\/h3>\n\n\n\n<p>Here the coolant used to reduce the heat of a combustion engine is oil. The engine transfers its heat to the oil, which then passes through an oil cooler\/ heat exchanger. This results in cooling the oil, which again flows back to the hot engine and keeps it cool.<\/p>\n\n\n\n<h2 id=\"h-fire-fighting-vehicles-manufacturers\">Fire Fighting Vehicles Manufacturers-<\/h2>\n\n\n\n<p><strong>Fire fighting vehicle manufacturers<\/strong> follow certain rules while designing a fire engine. Two basic things that are kept in mind are the color and implementation of audio-visual warnings so that the fire engine gets noticed in a traffic jam and reaches the place of emergency much faster without meeting any accident. <\/p>\n\n\n\n<p>For passive visual warnings, “Retro reflector” is used and for the active visual warning, colored lights or beacons are used. Whereas, for audio warnings, a siren and speaker are fitted with the engine body. However, the specification of the engine’s body varies from country to country.<\/p>\n\n\n\n<p>Talking about the global market, Europe leads the <strong>fire fighting vehicles<\/strong> industry. Whereas, 1st Attack Engineering Inc., Oshkosh, Alexis fire equipment, Ferrara Fire Apparatus, Inc., and Sutphen Corp. are some of the leading manufacturers of fire engines. <\/p>\n\n\n\n<p>The <strong>Industrial fire fighting vehicle manufacturers<\/strong> range from large MNCs to small privately-owned companies around the globe. It is also estimated that this industry will register a CAGR of 3.8% reaching US$ 5450 million in 2024 from US$ 4350 million in 2019.<\/p>\n\n\n\n<h2 id=\"h-avs-international-pvt-ltd-setting-a-benchmark\">AVS International Pvt. Ltd. setting a benchmark<\/h2>\n\n\n\n<p>The fire engines are constantly evolving and <strong>Industrial fire fighting vehicle manufacturers<\/strong> are trying to make them much smarter than before by adding special features to stand out from others. Also, the competition in the market is tough for the companies involved in this business. <\/p>\n\n\n\n<p>But AVS International has risen beside all the odds and its achievement of delivering 104 fire fighting vehicles to a country like Ghana is commendable. <\/p>\n\n\n\n<p>Though, the company sees it as their first step towards being a major global industry serving different nations with its versatile range of products. Despite being a<strong> fire fighting vehicles manufacturer<\/strong> and a supplier to different countries, AVS also manufactures safety products and equipment.&nbsp; If you want to get a detailed description of AVS products, please visit our website <a href=\"https:\/\/avsgroup.in\/\">https:\/\/avsgroup.in\/<\/a>.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>With an increased demand for the safety of lands and the lives of citizens and the threat of fire in densely populated areas, different countries are purchasing more and more high standard Industrial fire fighting vehicle. Earlier human propelled water pumps were used as a fire fighter, but with technological advancement, a wide variety of<br \/><a href=\"https:\/\/avsgroup.in\/2020\/11\/03\/avs-takes-ghana-by-storm-delivers-104-industrial-fire-fighting-vehicle\/\" class=\"more\">Read more<\/a><\/p>\n","protected":false},"author":3,"featured_media":8201,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8196"}],"collection":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/comments?post=8196"}],"version-history":[{"count":2,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8196\/revisions"}],"predecessor-version":[{"id":8908,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8196\/revisions\/8908"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media\/8201"}],"wp:attachment":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media?parent=8196"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/categories?post=8196"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/tags?post=8196"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}