{"id":8197,"date":"2020-11-03T09:44:54","date_gmt":"2020-11-03T09:44:54","guid":{"rendered":"https:\/\/avsgroup.in\/?p=8197"},"modified":"2021-02-02T17:39:04","modified_gmt":"2021-02-02T17:39:04","slug":"consecutively-5-times-national-state-award-winners-of-eepc-avs-international-pvt-ltd-exporter-of-the-year","status":"publish","type":"post","link":"https:\/\/avsgroup.in\/2020\/11\/03\/consecutively-5-times-national-state-award-winners-of-eepc-avs-international-pvt-ltd-exporter-of-the-year\/","title":{"rendered":"Consecutively 5 Times National &#038; State Award Winners of EEPC &#8211; AVS International Pvt. Ltd. &#8211; Exporter of the Year"},"content":{"rendered":"\n<p id=\"block-77866ba5-87b1-4459-8fd7-1e1694dc242b\">Engineering Export Promotion Council (EEPC) India, an organization that caters to the engineering industry is an interface between the government and the engineering industry.<\/p>\n\n\n\n<p id=\"block-bcb617e6-1041-4838-94df-d4ccfd8262dd\">Being a renowned premier trade and investment promotion organization, it is sponsored by the Ministry of Commerce and Industry. Thousands of companies from small scale industries to large scale MNCs are all part of EEPC India.<\/p>\n\n\n\n<p id=\"block-972cdcbc-50ce-4fe1-8061-8367b8d03a50\">EEPC has a ritual of praising the members involved in exporting business every year. It is done by presenting awards in different categories of engineering products.<\/p>\n\n\n\n<p id=\"block-ce558ceb-5bb6-4a49-a554-868888c2dec4\">They choose the best among all the companies that are a member of EEPC and who have performed extraordinarily well and whose efforts are commendable. Award winners are chosen based on how they have emerged as a leading exporter despite facing challenges, uncertainties, ups, and downs of the market.<\/p>\n\n\n\n<p id=\"block-1b156e8b-9bcb-434f-9ce1-c19b3d59127f\">The EEPC annual award surely holds a good reputation and is seen as a remarkable achievement for the companies who take it home. It clears it out that the competition level is very high with new members joining EEPC every year.<\/p>\n\n\n\n<h1 id=\"block-66861fa7-6b5f-4254-9bed-3e1b2f478dcb\">AVS International a 5 times EEPC award-winning company<\/h1>\n\n\n\n<p id=\"block-f57e77b2-4932-4451-bbeb-02e57c96d441\">AVS International Pvt. Ltd. a pioneer in the field of exporting products that range from specialized footwear to heavy-duty vehicles, has established itself as a trustworthy organization. Within a short span of around 10 plus years in the market, it has expanded by exporting products in different countries.<\/p>\n\n\n\n<p id=\"block-a1007fe2-7762-4b9c-a7ed-5dd95e5eefaa\">There’s no doubt that AVS International is not the only one <strong>EEPC award-winning company<\/strong> from Agra, but also has the honour of being the winner of this prestigious award for 5 consecutive years. The company won this award as a star performer in the product group of motor vehicles.<\/p>\n\n\n\n<p id=\"block-6ec753ef-ed82-4776-b69a-dc11c39f6108\">Additionally, it has taken Ghana by storm as it delivered 104 fire fighting vehicles to the country. AVS has international tie-ups with the government of African countries and is a famous exporter for heavy-duty vehicles over there.<\/p>\n\n\n\n<p id=\"block-9a3e81cb-a4e3-46d7-9a02-61343b825282\">Being associated with the renowned organization BEML, this MNC based out of India supplies specialized vehicles for construction, mining, defence, and transportation. Let’s take a look at the types of vehicles supplied by AVS International that made it win the EEPC award in the motor vehicle export category:<\/p>\n\n\n\n<h1 id=\"block-ee668f72-b5e7-45f0-9caf-05cd7309a2b8\">Types of motor vehicles by AVS International:<\/h1>\n\n\n\n<p id=\"block-366e6123-2dba-4985-9176-65a9413aec76\">A self-propelled vehicle containing wheels used for transportation of people and freight is known as a motor vehicle. AVS International exports motor vehicles, especially heavy-duty vehicles that are used for mining and defence services. Despite its international clientele, the company is also a reputed vehicle supplier to the Indian army.<\/p>\n\n\n\n<h2 id=\"block-6e587222-1d5f-4149-b7cd-f4b54fc9363a\">Construction<\/h2>\n\n\n\n<h3 id=\"block-c49eee16-88da-4b82-aa40-86949c1e765e\">1.&nbsp;&nbsp; Loader<\/h3>\n\n\n\n<p id=\"block-0d65b2e0-7b7a-4181-94f8-e8b927a18c60\">A heavy-duty truck that moves or loads the construction materials from one place and transfers onto a dump truck or another machinery like a conveyor belt. The materials can be dirt, snow, logs, gravel, asphalt, sand, rock, or raw minerals. It has a bucket at the front side connected on the ends of two booms, which serves as a scoop to load the material to be transferred.<\/p>\n\n\n\n<h3 id=\"block-ecdd3eca-82a7-4244-9a76-6fb58606ca9d\">2.&nbsp;&nbsp; Crane<\/h3>\n\n\n\n<p id=\"block-dd13ad9a-a79c-45c6-8edb-8be56337885e\">Crane is also a heavy-duty truck<strong>,<\/strong> used in transportation for loading and unloading of materials, in construction for moving of materials from one place to another and in manufacturing for assembling of heavy machines. It consists of sheaves and wire ropes used for lifting and moving of materials.<\/p>\n\n\n\n<h3 id=\"block-54726ef6-1dd5-4d8a-b0e1-4aabd784d69e\">3.&nbsp;&nbsp; Bulldozer<\/h3>\n\n\n\n<p id=\"block-e77ee557-1021-4889-9b3a-b31f8a41378b\">It is a type of tractor used for moving or pushing materials like sand or soil in a large quantity. A bulldozer consists of two tools namely a ripper and a blade. Ripper is attached to the backside of the bulldozer and is a claw-like device used to break rocky surfaces into small riddles. Whereas, a blade is a heavy metal plate used to push materials from one place to another.<\/p>\n\n\n\n<h2 id=\"block-631e9c7b-4724-4474-aaa8-b8b7d4cc9ad6\">Mining<\/h2>\n\n\n\n<h3 id=\"block-664225e7-83b1-4a2a-952a-62f8adecf29b\">1.&nbsp;&nbsp; Haul Trucks<\/h3>\n\n\n\n<p id=\"block-55f1eb46-e83b-44a4-b190-e2ebe6ec921f\">These are specially designed rigid dump trucks for high production mining. It takes or moves dumps of materials like sand or gravel to clear the path.&nbsp; It is also used for taking construction equipment from job site to job site. Haul truck capacity ranges from 40 short tons to 496 short tons.<\/p>\n\n\n\n<h3 id=\"block-6a234785-997c-4691-864d-96021ca3b739\">2.&nbsp;&nbsp; &nbsp;Excavator<\/h3>\n\n\n\n<p id=\"block-db62dc7e-9a86-4599-bc61-42b897f29d17\">These are also known as diggers and are used for digging trenches, construction, mining, forestry work, and demolition. It consists of a boom, dipper, bucket, and a cab that rotates on a platform. An excavator makes the use of hydraulic motors, cylinders, and fluid for performing multiple operations.<\/p>\n\n\n\n<h2 id=\"block-d9982df3-5a32-4265-b09c-9d1944284ef1\">Defence and rescue<\/h2>\n\n\n\n<h3 id=\"block-6adbf122-f5ba-4ed9-abfc-754481d9ad47\">1.&nbsp;&nbsp; Crash Fire Tender<\/h3>\n\n\n\n<p id=\"block-7eb8433f-60fb-417e-a1d7-2c4d1c764db1\">It is a type of <strong>heavy-duty truck<\/strong> specially designed for aircraft rescue and firefighting at military airbases. They consist of high capacity pumps and water cannons, which helps to deal with fire over long distances.<\/p>\n\n\n\n<h3 id=\"block-5f5b3276-d62d-457b-a39d-aba4f1d27554\">2.&nbsp;&nbsp; Heavy Recovery Vehicle<\/h3>\n\n\n\n<p id=\"block-9bc327f7-1b99-43a7-8a6e-c5ed72b2be4b\">These are used to recover stalled, buried, or overturned vehicles of the defence forces. Heavy recovery vehicles are capable of working in different terrains including desert, rocky and marshy grounds as well as hilly areas.<\/p>\n\n\n\n<h3 id=\"block-0d4c3462-dc68-4b17-8321-08bdffa0df0a\">3.&nbsp;&nbsp; Tatra Trucks<\/h3>\n\n\n\n<p id=\"block-d1cf5b88-6a22-4a02-9823-3ca9ca898360\">One of the specialties of AVS International, it is a terrain vehicle with high mobility used for GS roles in the Indian Army. Additionally, it transports army personnel and can carry payloads of about 10,500 kgs. It has a tire inflation system that enables the inflation\/deflation of tires depending on the condition of the terrain.<\/p>\n\n\n\n<h3 id=\"block-9a21a021-e5d2-418d-b51f-c534f210b86a\">4.&nbsp;&nbsp; Aircraft Refuellers<\/h3>\n\n\n\n<p id=\"block-b9dda831-33a0-4512-b5d2-eed6d9b15465\">These are used for transporting aviation fuel into the military aircraft. Also, they offer over wing and under wing refuelling along with operational control on the driver’s side. They are designed for both right-hand and left-hand traffic and are assembled on a three-axle truck chassis.<\/p>\n\n\n\n<p id=\"block-9dc1d237-f3b3-41b9-aa7d-8e8c8f1cdb94\">These are only a few examples of the motor vehicles exported by AVS International. The company has a wide range of different types of heavy-duty vehicles that includes dump trucks, Wheel dozers, Pipe layers, Motor Graders, Tyre Handlers, Water Sprinklers, etc.<\/p>\n\n\n\n<p id=\"block-d62e9797-07f8-4afe-af41-6791d95641a2\">Being an <strong>EEPC award-winning company<\/strong> and receiving the title of exporter of the year 5 times, AVS International Pvt. Ltd. is always evolving and trying to come up with innovative ideas and keeps the client’s needs on priority.<\/p>\n\n\n\n<p id=\"block-4317b096-4d6d-493f-a439-68b0019bc89a\">While many companies find it difficult to be a member of EEPC, this company has paved out its way out of all the challenges. It has won the EEPC award for both state and national levels leaving behind the major competitors. With a team of experts having in-depth knowledge about business and technology, AVS International is continuously working on improving their product quality.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Engineering Export Promotion Council (EEPC) India, an organization that caters to the engineering industry is an interface between the government and the engineering industry. Being a renowned premier trade and investment promotion organization, it is sponsored by the Ministry of Commerce and Industry. Thousands of companies from small scale industries to large scale MNCs are<br \/><a href=\"https:\/\/avsgroup.in\/2020\/11\/03\/consecutively-5-times-national-state-award-winners-of-eepc-avs-international-pvt-ltd-exporter-of-the-year\/\" class=\"more\">Read more<\/a><\/p>\n","protected":false},"author":3,"featured_media":8203,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8197"}],"collection":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/comments?post=8197"}],"version-history":[{"count":1,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8197\/revisions"}],"predecessor-version":[{"id":8204,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8197\/revisions\/8204"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media\/8203"}],"wp:attachment":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media?parent=8197"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/categories?post=8197"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/tags?post=8197"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}