{"id":8199,"date":"2020-11-03T09:50:39","date_gmt":"2020-11-03T09:50:39","guid":{"rendered":"https:\/\/avsgroup.in\/?p=8199"},"modified":"2021-02-02T17:39:04","modified_gmt":"2021-02-02T17:39:04","slug":"types-of-heavy-duty-vehicles-and-spare-parts","status":"publish","type":"post","link":"https:\/\/avsgroup.in\/2020\/11\/03\/types-of-heavy-duty-vehicles-and-spare-parts\/","title":{"rendered":"Types of Heavy Duty Vehicles and Spare Parts"},"content":{"rendered":"\n<p id=\"block-6fe879e8-9c2d-451b-bdee-211ee7ad2361\">The heavy duty vehicles and Spare parts market is on the verge to expand globally. With rapid industrialization and international trade activities, the heavy equipment providers are constantly working on improving vehicle efficiency.<\/p>\n\n\n\n<p id=\"block-6b7d7624-dab2-4ffe-bb0f-d061980da68c\">They are also focusing on increasing the truck fleet. Also, with the businesses moving onto e-commerce websites and online platforms have helped this industry to gain traction.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/avsgroup.in\/wp-content\/uploads\/2020\/07\/Mining-industry-in-africa-small-image-1024x491.jpg\" alt=\"\"\/><\/figure>\n\n\n\n<ul><li><\/li><\/ul>\n\n\n\n<p>This block contains unexpected or invalid content.ResolveConvert to HTMLAs a result of this increased production of&nbsp;<strong>heavy duty vehicles,<\/strong>&nbsp;the truck manufacturers and suppliers are also trying to produce more and more&nbsp;<strong>heavy duty vehicles spare parts<\/strong>. Thus, the market is estimated to grow at a rapid rate with a CAGR of 4% between 2019 and 2024.<br>Source &#8211;&nbsp;<a href=\"https:\/\/www.gminsights.com\/industry-analysis\/e-commerce-automotive-aftermarket\">E-commerce Automotive Aftermarket Size By E-commerce Retail<\/a><\/p>\n\n\n\n<h2 id=\"block-a1fe92b5-85f7-46ba-a208-c8c657849d22\">Heavy Duty Vehicles<\/h2>\n\n\n\n<p id=\"block-91a334c1-4c53-4546-adab-cc511c7e5306\">A heavy-duty vehicleis majorly used for long haul transportation and weighs around 26,001 pounds. Some examples include- road roller, excavator, mobile cranes, and dump truck.<\/p>\n\n\n\n<p id=\"block-9986b5b3-7a77-4da4-a1a2-1b3434b152ca\">Also referred to as a heavy-duty machine or heavy equipment, <strong>heavy duty vehicles <\/strong>are designed to perform construction tasks mainly earthwork operations. It comprises 5 equipment systems: implementation, traction, structure, power train, information, and control.<\/p>\n\n\n\n<h2 id=\"block-05824611-a26a-4ec4-9e85-be2037ee2954\">Types of heavy duty vehicles<\/h2>\n\n\n\n<h3 id=\"block-3b415776-52a7-4f98-86f1-cd8fb8525638\">1.&nbsp;&nbsp; Bulldozer<\/h3>\n\n\n\n<p id=\"block-c319f81e-36e3-40a6-932c-e89dfdecb4af\">It is a type of tractor used for moving or pushing materials like sand or soil in a large quantity. A bulldozer consists of two tools namely a ripper and a blade. Ripper is attached to the backside of the bulldozer and is a claw-like device used to break rocky surfaces into small riddles. Whereas, a blade is a heavy metal plate used to push materials from one place to another.<\/p>\n\n\n\n<h3 id=\"block-4b0b6308-dde5-4f55-9d8d-87918eeba074\">2.&nbsp;&nbsp; Dump Truck<\/h3>\n\n\n\n<p id=\"block-2267e8e7-f47b-40f4-925d-9bd5e2bed10f\">A dump truck is used for taking dumps of sand or demolition wastes for construction purposes. It is also known as a tipper truck or tip-trailer that contains hydraulic rams to uplift the front portion of the open bed box of the truck.<\/p>\n\n\n\n<h3 id=\"block-b0b3d1a8-934d-47ae-b952-bc510ded0551\">3.&nbsp;&nbsp; Excavator<\/h3>\n\n\n\n<p id=\"block-c9fa2cef-2868-458e-9538-8da604ec0096\">These are also known as diggers and are used for digging trenches, construction, <a rel=\"noreferrer noopener\" href=\"https:\/\/avsgroup.in\/mining\/\" target=\"_blank\">mining<\/a>, forestry work, and demolition. It consists of a boom, dipper, bucket, and a cab that rotates on a platform. An excavator makes the use of hydraulic motors, cylinders, and fluid for performing multiple operations.<\/p>\n\n\n\n<h3 id=\"block-8237bffb-b2a8-4b8c-9cfb-5602fd2714d7\">4.&nbsp;&nbsp; Loader<\/h3>\n\n\n\n<p id=\"block-673a1f61-e415-4d05-b452-939599ff8274\">&nbsp;A heavy-duty truck that moves or loads the construction materials from one place and transfers onto a dump truck or another machinery like a conveyor belt.<\/p>\n\n\n\n<p id=\"block-1d472ddd-8ab1-4285-b9d5-c7ab3859829c\">The materials can be dirt, snow, logs, gravel, asphalt, sand, rock, or raw minerals. It has a bucket at the front side connected on the ends of two booms, which serves as a scoop to load the material to be transferred.<\/p>\n\n\n\n<h3 id=\"block-66dcedff-51bc-4e88-bb2e-6345083d5e26\">5.&nbsp;&nbsp; Crane<\/h3>\n\n\n\n<p id=\"block-9c12488c-8c0c-4231-a1da-a4cfef0d451a\">Crane is also a <a rel=\"noreferrer noopener\" href=\"https:\/\/avsgroup.in\/heavy-duty-vehicles-equipment\/\" target=\"_blank\">heavy duty truck<strong>,<\/strong> used in transportation for loading<\/a> and unloading of materials, in construction for moving of materials from one place to another and in manufacturing for assembling of heavy machines. It consists of sheaves and wire ropes used for lifting and moving of materials.<\/p>\n\n\n\n<h2 id=\"block-7837883b-971e-4879-978a-557f0c0c549c\">Experience of an international manufacturer &#8211; Heavy duty vehicles and spare parts<\/h2>\n\n\n\n<p id=\"block-5457e97f-6a56-4f3c-8f8c-16a1605bfdd1\">A spare part is a duplicate part of a machine or vehicle that is used as a replacement of a damaged or lost part of the vehicle. It is categorized into two types namely:<\/p>\n\n\n\n<h2 id=\"block-3ea4304a-7cba-4be1-9931-ccb4cdcfd09e\">●&nbsp;&nbsp;&nbsp; Repairable<\/h2>\n\n\n\n<p id=\"block-6dcfb3ef-a40f-4dcb-bfa6-3f67f407bb2a\">Being modular, these are affordable to maintain and allows to repair the part instead of bearing the cost of fully replacing it.<\/p>\n\n\n\n<h2 id=\"block-210aff03-367c-4f15-b09c-5d8683c66eb9\">●&nbsp;&nbsp;&nbsp; Consumable<\/h2>\n\n\n\n<p id=\"block-14295155-97b3-4981-8a54-9e2dfd173e2a\">These are non-repairable parts and are turned into scrap once they stop functioning. The only option they offer is to replace them completely with a duplicate one.<\/p>\n\n\n\n<h2 id=\"block-54bb5d6c-6b59-475f-9b8c-1ba8d1c939ee\">Most commonly used heavy duty vehicles and spare parts<\/h2>\n\n\n\n<h3 id=\"block-57ab4312-4775-464a-85cf-f4bb0c0d9acf\">1.&nbsp;&nbsp; Radius Rod<\/h3>\n\n\n\n<p id=\"block-05cd65db-db4a-4f95-a93d-6449a3d2cd44\">It is a type of suspension link which attaches at two points and helps in maintaining the motion of the wheels in a longitudinal direction. One of the ends of this link is connected to the axle and the other end is connected to the chassis of the <strong>heavy duty vehicles<\/strong>.<\/p>\n\n\n\n<h3 id=\"block-76547187-d068-4c92-83df-584b0f7af291\">2.&nbsp;&nbsp; Air Compressor<\/h3>\n\n\n\n<p id=\"block-2396a71d-c512-4567-8347-fd1f82262c2b\">It is one of the most important <strong>heavy duty vehicles and spare parts<\/strong> that utilize energy to compress air. In other words, an air compressor converts power stored in pressurized air into potential energy.<\/p>\n\n\n\n<p id=\"block-3f4e9fc1-4356-4f96-9582-a7788669bc28\">It does this by forcing air into a storage tank hence increasing the pressure. Once the pressure in the tank reaches its upper limit, the compressor shuts off. Whereas, once the compressed air is utilized by the vehicle it re-pressurizes the tank again.<\/p>\n\n\n\n<h3 id=\"block-876a329a-6668-4505-919e-8219ce056b56\">3.&nbsp;&nbsp; Hose<\/h3>\n\n\n\n<p id=\"block-1bb2ee34-cb8c-46bf-b41b-a5e61d7f6f90\">These are flexible cylindrical pipes or tubes which are used to carry fluids from one place to another. In heavy vehicles, they are used for heating, cooling, lubrication, brake and locking systems. Usually, hoses are made of PVC, polyurethane, nylon, rubbers, and polyethylene.<\/p>\n\n\n\n<h3 id=\"block-0a5e18c1-39aa-4af4-9763-763d912f80a2\">4.&nbsp;&nbsp; Camshaft<\/h3>\n\n\n\n<p id=\"block-51897433-43b6-498a-9fae-55dcc6bd384a\">&nbsp;It is a piece of rod that consists of cams and converts rotational motion into linear motion by rotating against a piece of machinery. Usually, Cast-iron and Billet steel are used to make a Camshaft.&nbsp; A camshaft moves closer and further from the rotational axis when pushed by the machinery. These moving parts are known as “Cams”.<\/p>\n\n\n\n<h3 id=\"block-542b4c20-23b2-465c-8243-38d9ba438da5\">5.&nbsp;&nbsp; Crankshaft<\/h3>\n\n\n\n<p id=\"block-1770bd1f-49b8-45e0-b0a3-4408b36238f3\">Just like Camshaft, it is also a piece of rod that converts the linear motion of pistons into rotational motion. Additionally, it also transmits power to other engine systems like oil pump, cooling pump, and air conditioning compressor.<\/p>\n\n\n\n<h3 id=\"block-b288ed51-ad0c-4a47-bab7-375c08fa09b6\">6.&nbsp;&nbsp; Head Gasket<\/h3>\n\n\n\n<p id=\"block-ddb009ce-8a7f-4cca-ad66-91f54aa59e35\">It is used to seal the cylinders to avoid any kind of leakage of coolant or oil and maintain the best compression level. In an internal combustion engine, a head gasket is placed between the engine block and cylinder head.<\/p>\n\n\n\n<p id=\"block-4879a5a6-9bcc-4bd6-957d-ebdf7bd0f4ee\">Engine mounting bracket, rocker shaft, overflow valve, intermediate bearing, bushings, armature, clutch back plate, etc. are some other <strong>heavy duty vehicles and spare parts<\/strong>.&nbsp;<\/p>\n\n\n\n<h2 id=\"block-2f750d5d-5042-42fa-a867-819fda80c8d6\">Heavy duty Vehicles and spare parts by AVS International<\/h2>\n\n\n\n<p id=\"block-11d4adfb-417d-4fcc-971c-0052af4d1364\">These are just some of the most commonly used heavy vehicle types and their spare parts. A vast range of these are available in the market and come in different types for various purposes like agriculture, mining, transportation, construction, and defence services.<\/p>\n\n\n\n<p id=\"block-99129416-c552-4303-99bb-ffa208c42b70\">The spare parts and <strong>heavy duty vehicles<\/strong> market is a huge industry on a global level with numerous market players. Ashok Leyland, Tata Motors, Bharat Forge, Sundram Fasteners Limited are some of them.<\/p>\n\n\n\n<p id=\"block-326f9ddd-22d0-4ab5-a8a5-eebe97521f8d\">AVS International Pvt. Ltd. a decade old MNC from India, is an emerging market player in this industry. They are associated with a renowned organization- “BEML” and are one of the most trusted suppliers of <strong>heavy duty vehicles<\/strong> and their spare parts around the globe.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The heavy duty vehicles and Spare parts market is on the verge to expand globally. With rapid industrialization and international trade activities, the heavy equipment providers are constantly working on improving vehicle efficiency. They are also focusing on increasing the truck fleet. Also, with the businesses moving onto e-commerce websites and online platforms have helped<br \/><a href=\"https:\/\/avsgroup.in\/2020\/11\/03\/types-of-heavy-duty-vehicles-and-spare-parts\/\" class=\"more\">Read more<\/a><\/p>\n","protected":false},"author":3,"featured_media":8207,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8199"}],"collection":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/comments?post=8199"}],"version-history":[{"count":1,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8199\/revisions"}],"predecessor-version":[{"id":8208,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8199\/revisions\/8208"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media\/8207"}],"wp:attachment":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media?parent=8199"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/categories?post=8199"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/tags?post=8199"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}