{"id":8212,"date":"2020-11-03T10:07:36","date_gmt":"2020-11-03T10:07:36","guid":{"rendered":"https:\/\/avsgroup.in\/?p=8212"},"modified":"2021-02-02T17:39:04","modified_gmt":"2021-02-02T17:39:04","slug":"coronavirus-impact-on-footwear-industry-covid-19-outbreaks","status":"publish","type":"post","link":"https:\/\/avsgroup.in\/2020\/11\/03\/coronavirus-impact-on-footwear-industry-covid-19-outbreaks\/","title":{"rendered":"Coronavirus Impact on Footwear Industry, COVID-19 Outbreaks"},"content":{"rendered":"\n<p>The outrageous Corona outbreak has tumbled the global market and affected the economy of many countries worldwide. With the closure of educational institutes, malls, theatres, and corporate offices, the customer’s buying behaviors have been changed. As a result, it has made companies restructure their business models. The social distancing has changed the business trends vastly and will have a long-term effect. The footwear industry is too not left untouched with the <strong>coronavirus impact on footwear industries<\/strong>.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" src=\"https:\/\/avsgroup.in\/wp-content\/uploads\/2020\/07\/4-1024x491.jpg\" alt=\"\" class=\"wp-image-1177\"\/><\/figure>\n\n\n\n<p><strong>Footwear Industry<\/strong><\/p>\n\n\n\n<p>The <strong>footwear industry<\/strong> is recurring a loss of about trillions of dollars due to the corona virus impact on business. As a result of which, industry leaders are finding innovative and productive ways to adapt to the new trends that are going to stay even post COVID-19.<\/p>\n\n\n\n<h2 id=\"h-coronavirus-impact-on-business\"><strong>Coronavirus Impact on business:<\/strong><\/h2>\n\n\n\n<p>The global market is highly affected by the COVID-19 outbreak. Also, because of the reason that public places are being closed for a long time has decreased the demand for footwear. Apart from this, to maintain social distancing and with an allowance of opening offices with only 20-50% of the staff has a long-term effect on the global <strong>footwear industry<\/strong>.<\/p>\n\n\n\n<h3 id=\"h-coronavirus-impact-on-businesses-in-the-global-market\"><strong>Coronavirus&#8217; impact on businesses in the global market:<\/strong><\/h3>\n\n\n\n<ul><li>Millions of labourers lost their jobs<\/li><li>Stores shut for a longer period for safety purposes<\/li><li>Massive decrease in sales<\/li><li>Fall in demand for footwear worldwide<\/li><li>Direct effect on supply chain compositions<\/li><\/ul>\n\n\n\n<p>According to a report, the major market players in the <strong>footwear industry <\/strong>namely- Puma and Adidas, have recurred a loss of around $50-$60 million. This is because of a decrease in demand, along with the shutting of stores in virus-driven countries.<\/p>\n\n\n\n<p>Not only this pandemic has affected direct sales, but it has done something good as well for the global footwear market. It has made shoemakers rethink and reframe their marketing and manufacturing processes and strategies. As the need and buying behaviour has been changed due to this outbreak, it will drag more customers towards e-commerce shopping.<\/p>\n\n\n\n<h3 id=\"h-major-changes-in-businesses-post-covid-19\"><strong>Major changes in businesses post Covid-19:<\/strong><\/h3>\n\n\n\n<ul><li>Diversifying supply chains<\/li><li>Becoming less reliant on China<\/li><li>Shifting to E-commerce<\/li><li>Importing the footwear components within the country<\/li><li>New safety measures for manufacturing footwear<\/li><li>Renewing marketing strategies<\/li><li>Safe and healthy environments for both consumers and employees<\/li><li>Contactless payment<\/li><\/ul>\n\n\n\n<h2 id=\"h-coronavirus-impact-on-footwear-industry-in-india\"><strong>Coronavirus Impact on Footwear Industry in India<\/strong><\/h2>\n\n\n\n<p>As major footwear stores have been shut for almost 2 months, it has drastically impacted the footwear sales. Many brands have postponed the launch of new products plus collections and are waiting for the situation to get normal. Additionally, as the country is facing a dreadful time, its <strong>footwear industry<\/strong> is dealing with a serious problem when it comes to supply chain management.<\/p>\n\n\n\n<ul><li>Huge cancellations saw the industry lose around $1 billion worth of export orders. -(Aqeel Ahmed, chairman, Council For Leather Export)<\/li><\/ul>\n\n\n\n<ul><li>Given the closure of retail outlets and restriction of delivery of non-essential items in certain areas, the revenues for FY2021 are expected to drop by 10-15 percent as compared to FY2020, with a larger impact on profitability”- stated by ICRA.<\/li><\/ul>\n\n\n\n<p>As the manufacturing units in China have been closed and now with many Indian companies deciding to boycott China products, it is resulting in huge loss to the Indian shoemakers and suppliers. The country’s footwear manufacturers highly rely on China for importing components like:<\/p>\n\n\n\n<ul><li>Insoles<\/li><li>Outsoles<\/li><li>Laces<\/li><li>Shoe lining<\/li><li>Shank board<\/li><li>Buckles<\/li><li>Foam<\/li><li>Packing material<\/li><li>Ornaments<\/li><\/ul>\n\n\n\n<p>With the scarcity of these components, it has led many brands to increase the prices of footwear. Whereas, some brands are offering discounts on footwear to generate revenue.<\/p>\n\n\n\n<p>Along with this, the other footwear companies that were importing components within the country, witnessed a tremendous loss since the corona outbreak hit the country both online and offline. Agra, being the hub of the leather industry is facing a tough time due to the decrease in sales. Footwear, worth RS.3000 crores are exported every year from Agra to Europe, but this pandemic has directly hit hard on the exporting business of footwear.<\/p>\n\n\n\n<p>Although, many suppliers are continuing to cater to their target group even in these difficult times by leveraging online platforms. Amongst which <strong>AVS International<\/strong>, being a reputed brand name for supplying a versatile range of footwear is all set to serve its customers with shoes that are comfortable and durable.<\/p>\n\n\n\n<h3 id=\"h-ray-of-hope-in-these-difficult-times\"><strong>Ray of hope in these difficult times&nbsp;&nbsp;&nbsp;&nbsp;<\/strong><\/h3>\n\n\n\n<p>As the brands are about to open their stores, they will be focusing more on the online selling of their products. The <strong>footwear industry<\/strong> will now rely more on the local component suppliers that will create new employment opportunities. But as the <strong>coronavirus impact on the footwear industry <\/strong>seems to have a long-term effect on the footwear market, its high time that companies redefine their policies and innovate ways to make the best out of it. <strong>AVS International Pvt. Ltd.<\/strong> is constantly evolving and adapting these new market trends to offer footwear that is long-lasting and comfortable to its customers.<\/p>\n\n\n\n<p><strong>“<\/strong><em>Every area of trouble gives out a ray of hope; and the one unchangeable certainty is that nothing is certain or unchangeable<\/em>.”-<strong> John F. Kennedy<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>The outrageous Corona outbreak has tumbled the global market and affected the economy of many countries worldwide. With the closure of educational institutes, malls, theatres, and corporate offices, the customer’s buying behaviors have been changed. As a result, it has made companies restructure their business models. The social distancing has changed the business trends vastly<br \/><a href=\"https:\/\/avsgroup.in\/2020\/11\/03\/coronavirus-impact-on-footwear-industry-covid-19-outbreaks\/\" class=\"more\">Read more<\/a><\/p>\n","protected":false},"author":3,"featured_media":8213,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8212"}],"collection":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/comments?post=8212"}],"version-history":[{"count":2,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8212\/revisions"}],"predecessor-version":[{"id":8907,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/posts\/8212\/revisions\/8907"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media\/8213"}],"wp:attachment":[{"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/media?parent=8212"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/categories?post=8212"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/avsgroup.in\/wp-json\/wp\/v2\/tags?post=8212"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}